# 企业发放的奖金根据利润提成。利润低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润，求应发放奖金总数？

print("*" * 50)
profit = int(input("请输入当月利润(单位/万元)："))
money = 0
    #判断
if profit <= 10:
    money = profit * 0.1
elif profit <= 20:
    money = 10*0.1 + (profit - 10)*0.175
elif profit <= 40:
    money = 10*0.1 + 10*0.175 + (profit - 20)*0.225
elif profit <= 60:
    money = 10*0.1 + 10*0.175 + 20*0.225 + (profit - 40)*0.255
elif profit <= 100:
    money = 10*0.1 + 10*0.175 + 20*0.225 + 20*0.255 + (profit - 60)*0.27
else:
    money = 10*0.1 + 10*0.175 + 20*0.225 + 20*0.255 + 40*0.27 + (profit -100)*0.28
print("\n应发放奖金为：%s" % money)
print("*" * 50)